# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2024-02-23 22:08:53 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Pythia
  Pythia aims to be a desktop search engine, like Beagle or Tracker.
  Pythia is named after the title of the priestress at the ancient Oracle of
  Delphi. Before Apollo claimed the site, it was inhabited by a giant
  snake/dragon named Python, which is where the giant snakes get their name
  from, and ultimately the programming language Python as well (via Monty
  Python).
** Clocktable
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2024-02-23 Fr 22:08]
   | Headline               | Time    |         |      |      |
   |------------------------+---------+---------+------+------|
   | *Total time*           | *12:18* |         |      |      |
   |------------------------+---------+---------+------+------|
   | *Pythia*               | *12:18* |         |      |      |
   | \_  /Components [0/0]/ |         | /12:18/ |      |      |
   | \_    Data types [0/0] |         |         | 2:59 |      |
   | \_    Database [0/0]   |         |         | 7:03 |      |
   | \_    Crawler [0/1]    |         |         | 2:16 |      |
   | \_      Blacklist      |         |         |      | 0:32 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Data types [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-02-22 Do 17:26]--[2024-02-22 Do 17:27] =>  0:01
    CLOCK: [2024-02-21 Mi 14:52]--[2024-02-21 Mi 17:50] =>  2:58
    :END:
*** Database [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-02-23 Fr 19:25]--[2024-02-23 Fr 22:08] =>  2:43
    CLOCK: [2024-02-23 Fr 15:52]--[2024-02-23 Fr 18:38] =>  2:46
    CLOCK: [2024-02-22 Do 18:05]--[2024-02-22 Do 19:05] =>  1:00
    CLOCK: [2024-02-22 Do 17:27]--[2024-02-22 Do 18:01] =>  0:34
    :END:
*** Crawler [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-02-23 Fr 13:14]--[2024-02-23 Fr 13:14] =>  0:00
    CLOCK: [2024-02-23 Fr 08:55]--[2024-02-23 Fr 09:14] =>  0:19
    CLOCK: [2024-02-22 Do 19:10]--[2024-02-22 Do 20:35] =>  1:25
    :END:
**** TODO Blacklist
     :LOGBOOK:
     CLOCK: [2024-02-23 Fr 15:35]--[2024-02-23 Fr 15:52] =>  0:17
     CLOCK: [2024-02-23 Fr 13:14]--[2024-02-23 Fr 13:29] =>  0:15
     :END:
*** Extractors [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    Extractors attempt to get text content from various file formats.
*** UI [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    I have been thinking about trying out Qt5 or Qt6 which have Python
    bindings. I used Qt4 in C++ years ago for a few toy projects, and I
    remember the experience as being rather nice.
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
